In [3]:
import pandas as pd
data = pd.DataFrame({'group':['a','a','a','b','b','b','c','c','c'],
                    'data':[4,3,2,1,12,3,4,5,7]})
data

  group  data
0     a     4
1     a     3
2     a     2
3     b     1
4     b    12
5     b     3
6     c     4
7     c     5
8     c     7

In [4]:
data.sort_values(by=['group','data'],ascending = [False,True],inplace=True)
#group降序，data升序基于group的降序（不改变顺序），对data升序
data

  group  data
6     c     4
7     c     5
8     c     7
3     b     1
5     b     3
4     b    12
2     a     2
1     a     3
0     a     4

In [5]:
data = pd.DataFrame({'k1':['one']*3+['two']*4,
                   'k2':[3,2,1,3,3,4,4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [6]:
data.sort_values(by='k2')

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [7]:
data.drop_duplicates()#去掉重复项，指k1和k2都重复的情况

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

In [8]:
data.drop_duplicates(subset='k1')#去掉k1的重复项

    k1  k2
0  one   3
3  two   3

In [9]:
data = pd.DataFrame({'food':['A1','A2','B1','B2','B3','C1','C2'],'data':[1,2,3,4,5,6,7]})
data

  food  data
0   A1     1
1   A2     2
2   B1     3
3   B2     4
4   B3     5
5   C1     6
6   C2     7

In [10]:
def food_map(series):#自定义一个函数
    if series['food'] == 'A1':
        return 'A'
    elif series['food'] == 'A2':
        return 'A'
    elif series['food'] == 'B1':
        return 'B'
    elif series['food'] == 'B2':
        return 'B'
    elif series['food'] == 'B3':
        return 'B'
    elif series['food'] == 'C1':
        return 'C'
    elif series['food'] == 'C2':
        return 'C'
data['food_map'] = data.apply(food_map,axis = 'columns')
#对其中每一个样本都执行food_map(series)函数
#axis = 'columns'按列排布
data

  food  data food_map
0   A1     1        A
1   A2     2        A
2   B1     3        B
3   B2     4        B
4   B3     5        B
5   C1     6        C
6   C2     7        C

In [11]:
food2Upper = {
    'A1':'A',
    'A2':'A',
    'B1':'B',
    'B2':'B',
    'B3':'B',
    'C1':'C',
    'C2':'C'
}
data['upper'] = data['food'].map(food2Upper)#map里面穿进去一个字典
data

  food  data food_map upper
0   A1     1        A     A
1   A2     2        A     A
2   B1     3        B     B
3   B2     4        B     B
4   B3     5        B     B
5   C1     6        C     C
6   C2     7        C     C

In [17]:
import numpy as np
df = pd.DataFrame({'data1':np.random.randn(5),#生成5个服从标准正态分布的随机数
                  'data2':np.random.randn(5)})
df2 = df.assign(ration = df['data1']/df['data2'])#用 assign() 创建新列 ration
#上面的内容也可用这样实现：
#df['ration']=df['data1']/df['data2']

In [18]:
df2

      data1     data2    ration
0  1.175727 -0.932559 -1.260753
1  1.305813 -0.531515 -2.456773
2  0.208154 -1.271713 -0.163680
3 -0.742142 -0.251859  2.946661
4 -0.268915  0.501108 -0.536641

In [19]:
df2.drop('ration',axis='columns',inplace=True)#删除列名

In [20]:
df2

      data1     data2
0  1.175727 -0.932559
1  1.305813 -0.531515
2  0.208154 -1.271713
3 -0.742142 -0.251859
4 -0.268915  0.501108

In [21]:
data = pd.Series([1,2,3,4,5,6,7,8,9])
data

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [22]:
data.replace(9,np.nan,inplace=True)#进行替换

In [23]:
data

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
8    NaN
dtype: float64

In [25]:
ages = [15,18,20,21,22,34,41,52,63,79]
bins = [10,40,80]#自己设置区间，对连续值进行离散化，把连续值映射到范围中
bins_res = pd.cut(ages,bins)
bins_res

[(10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (40, 80], (40, 80], (40, 80], (40, 80]]
Categories (2, interval[int64, right]): [(10, 40] < (40, 80]]

In [28]:
bins_res.codes

array([0, 0, 0, 0, 0, 0, 1, 1, 1, 1], dtype=int8)

In [29]:
pd.value_counts(bins_res)

/var/folders/fd/2xpkmx291nb0f5ywz1xwc42h0000gn/T/ipykernel_3642/1287572817.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(bins_res)

(10, 40]    6
(40, 80]    4
Name: count, dtype: int64

In [30]:
pd.cut(ages,[10,30,50,80])

[(10, 30], (10, 30], (10, 30], (10, 30], (10, 30], (30, 50], (30, 50], (50, 80], (50, 80], (50, 80]]
Categories (3, interval[int64, right]): [(10, 30] < (30, 50] < (50, 80]]

In [32]:
group_names = ['Yonth','Mille','Old']
#pd.cut(ages,[10,20,50,80],labels=group_names)
pd.value_counts(pd.cut(ages,[10,20,50,80],labels=group_names))
#labels=group_names为区间指定名字

/var/folders/fd/2xpkmx291nb0f5ywz1xwc42h0000gn/T/ipykernel_3642/4018458898.py:3: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(pd.cut(ages,[10,20,50,80],labels=group_names))

Mille    4
Yonth    3
Old      3
Name: count, dtype: int64

In [37]:
df = pd.DataFrame([range(3),[0, np.nan,0],[0,0,np.nan],range(3)])
df
#range(3),         # 第1行：[0, 1, 2]
    #[0, np.nan, 0],   # 第2行：0, 缺失值, 0
    #[0, 0, np.nan],   # 第3行：0, 0, 缺失值
    #range(3)          # 第4行：重复 [0, 1, 2]

   0    1    2
0  0  1.0  2.0
1  0  NaN  0.0
2  0  0.0  NaN
3  0  1.0  2.0

In [38]:
df.isnull()#检查 DataFrame 中的每个元素是否为缺失值（NaN），返回一个布尔型的 DataFrame。

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [41]:
df.isnull().any()#判断每一列是否有缺失值

0    False
1     True
2     True
dtype: bool

In [42]:
df.isnull().any(axis = 1)#判断每一行是否有缺失值

0    False
1     True
2     True
3    False
dtype: bool

In [44]:
df.fillna(5)#将缺失值填充为5

   0    1    2
0  0  1.0  2.0
1  0  5.0  0.0
2  0  0.0  5.0
3  0  1.0  2.0

In [45]:
df[df.isnull().any(axis = 1)]#筛选出至少有一个缺失值的行
#df.isnull()：返回一个布尔型 DataFrame，这个 DataFrame 的结构和原 DataFrame 一样。
#any(axis=1)：只要某行存在至少一个 True，就会返回 True；若整行都是 False，则返回 False。
#布尔索引 df[...]：把布尔型 Series 当作索引传入原 DataFrame。只会保留对应值为 True 的行。

   0    1    2
1  0  NaN  0.0
2  0  0.0  NaN